tsung/scenario0.xml
<!DOCTYPE tsung SYSTEM "/opt/homebrew/Cellar/tsung/1.8.0/share/tsung/tsung-1.0.dtd">
<!-- [ <!ENTITY mysession1 SYSTEM "record0.xml"> ] > -->

<tsung loglevel="notice" version="1.0">

    <clients>
        <client host="localhost" use_controller_vm="true"/>
    </clients>
    <servers>
        <server host="172.22.99.60" port="8000" type="tcp"/>
    </servers>

    <load duration="5" unit="minute">
        <arrivalphase phase="1" duration="10" unit="minute">
            <users maxnumber="10" arrivalrate="100" unit="second"/>
        </arrivalphase>
    </load>

    <options>
        <option name="file_server" id="queryset" value="./queryset.csv"/>
    </options>

    <sessions>
        <session probability="100" name="ab" type="ts_http">
            <for from="1" to="1000" var="i">
                <thinktime min="2" max="10" random="true"/>

                <setdynvars sourcetype="file" fileid="queryset" delimiter="§" order="random">
                     <var name="movieName" />
                     <var name="movieId" />
                </setdynvars>

                <request subst="true">
                    <http url='/?name=%%_movieName%%' version='1.1' method='GET'>
                        <http_header name='Accept' value='text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8' />
                        <http_header name='Accept-Encoding' value='gzip, deflate' />
                        <http_header name='Accept-Language' value='it-IT,it;q=0.8,en-US;q=0.5,en;q=0.3' />
                    </http>
                </request>

                <request subst="true">
                    <http url='/movie/%%_movieId%%' version='1.1' method='GET'>
                        <http_header name='Accept' value='text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8' />
                        <http_header name='Accept-Encoding' value='gzip, deflate' />
                        <http_header name='Accept-Language' value='it-IT,it;q=0.8,en-US;q=0.5,en;q=0.3' />
                    </http>
                </request>
            </for>
        </session>
    </sessions>

    <!--<sessions> &mysession1; </sessions>-->
</tsung>